[NoCoverage] StringLiteral
src/App.tsx:24:8
 import { SingleBookGraphql } from "./pages/SingleBookGraphql"
 
 Sentry.init({
-  dsn: "https://e8dbc539794b8d76d4c6c2b61d2cbd1e@o4506865523228672.ingest.us.sentry.io/4506865580113920",
+  dsn: "",
   integrations: [
     Sentry.browserTracingIntegration(),

[NoCoverage] ObjectLiteral
src/App.tsx:27:30
   dsn: "https://e8dbc539794b8d76d4c6c2b61d2cbd1e@o4506865523228672.ingest.us.sentry.io/4506865580113920",
   integrations: [
     Sentry.browserTracingIntegration(),
-    Sentry.replayIntegration({
-      maskAllText: false,
-      blockAllMedia: false,
-    }),
+    Sentry.replayIntegration({}),
   ],
   // Performance Monitoring

[NoCoverage] BooleanLiteral
src/App.tsx:28:20
   integrations: [
     Sentry.browserTracingIntegration(),
     Sentry.replayIntegration({
-      maskAllText: false,
+      maskAllText: true,
       blockAllMedia: false,
     }),

[NoCoverage] BooleanLiteral
src/App.tsx:29:22
     Sentry.browserTracingIntegration(),
     Sentry.replayIntegration({
       maskAllText: false,
-      blockAllMedia: false,
+      blockAllMedia: true,
     }),
   ],

[NoCoverage] ArrayDeclaration
src/App.tsx:35:28
   // Performance Monitoring
   tracesSampleRate: 1.0, //  Capture 100% of the transactions
   // Set 'tracePropagationTargets' to control for which URLs distributed tracing should be enabled
-  tracePropagationTargets: ["localhost", /^https:\/\/joyful-crumble-5dc627.netlify\.app/],
+  tracePropagationTargets: [],
   // Session Replay
   replaysSessionSampleRate: 0.1, // This sets the sample rate at 10%. You may want to change it to 100% while in development and then sample at a lower rate in production.

[NoCoverage] StringLiteral
src/App.tsx:42:8
 })
 
 const httpLink = new HttpLink({
-  uri: "http://localhost:4000/graphql",
+  uri: "",
 })
 

[NoCoverage] ObjectLiteral
src/App.tsx:45:34
   uri: "http://localhost:4000/graphql",
 })
 
-const wsLink = new WebSocketLink({
-  uri: `ws://localhost:4000/graphql`,
-  options: {
-    reconnect: true,
-  },
-})
+const wsLink = new WebSocketLink({})
 
 const splitLink = split(

[NoCoverage] BooleanLiteral
src/App.tsx:48:16
 const wsLink = new WebSocketLink({
   uri: `ws://localhost:4000/graphql`,
   options: {
-    reconnect: true,
+    reconnect: false,
   },
 })

[NoCoverage] BlockStatement
src/App.tsx:53:18
 })
 
 const splitLink = split(
-  ({ query }) => {
-    const definition = getMainDefinition(query)
-    return definition.kind === "OperationDefinition" && definition.operation === "subscription"
-  },
+  ({ query }) => {},
   wsLink,
   httpLink

[NoCoverage] LogicalOperator
src/App.tsx:55:12
 const splitLink = split(
   ({ query }) => {
     const definition = getMainDefinition(query)
-    return definition.kind === "OperationDefinition" && definition.operation === "subscription"
+    return definition.kind === "OperationDefinition" || definition.operation === "subscription"
   },
   wsLink,

[NoCoverage] ConditionalExpression
src/App.tsx:55:12
 const splitLink = split(
   ({ query }) => {
     const definition = getMainDefinition(query)
-    return definition.kind === "OperationDefinition" && definition.operation === "subscription"
+    return false
   },
   wsLink,

[NoCoverage] BlockStatement
src/App.tsx:66:81
   cache: new InMemoryCache(),
 })
 
-const RouteWithErrorBoundary = ({ children }: { children: React.ReactNode }) => {
-  return <ErrorBoundary fallback={<div>Something went wrong</div>}>{children}</ErrorBoundary>
-}
+const RouteWithErrorBoundary = ({ children }: { children: React.ReactNode }) => {}
 
 const router = createBrowserRouter([

[NoCoverage] ObjectLiteral
src/App.tsx:71:3
 }
 
 const router = createBrowserRouter([
-  {
-    path: "/",
-    element: (
-      <RouteWithErrorBoundary>
-        <Navigation />
-      </RouteWithErrorBoundary>
-    ),
-  },
+  {},
   {
     path: "/conditional-rendering",

[NoCoverage] ObjectLiteral
src/App.tsx:87:3
       </RouteWithErrorBoundary>
     ),
   },
-  {
-    path: "/user/:userId",
-    element: (
-      <RouteWithErrorBoundary>
-        <UserPage />
-      </RouteWithErrorBoundary>
-    ),
-    errorElement: <div>Something went wrong - BUTTON</div>,
-  },
+  {},
   {
     path: "/forms",

[NoCoverage] StringLiteral
src/App.tsx:88:11
     ),
   },
   {
-    path: "/user/:userId",
+    path: "",
     element: (
       <RouteWithErrorBoundary>

[NoCoverage] StringLiteral
src/App.tsx:97:11
     errorElement: <div>Something went wrong - BUTTON</div>,
   },
   {
-    path: "/forms",
+    path: "",
     element: <Forms />,
   },

[NoCoverage] StringLiteral
src/App.tsx:101:11
     element: <Forms />,
   },
   {
-    path: "/book/:bookId",
+    path: "",
     element: <SingleBook />,
   },

[NoCoverage] ObjectLiteral
src/App.tsx:116:3
       </RouteWithErrorBoundary>
     ),
   },
-  {
-    path: "book-list-graphql",
-    element: <BookListGraphqlPage />,
-  },
+  {},
   {
     path: "/styling3",

[NoCoverage] StringLiteral
src/App.tsx:117:11
     ),
   },
   {
-    path: "book-list-graphql",
+    path: "",
     element: <BookListGraphqlPage />,
   },

[NoCoverage] StringLiteral
src/App.tsx:121:11
     element: <BookListGraphqlPage />,
   },
   {
-    path: "/styling3",
+    path: "",
     element: <Styling3 />,
   },

[NoCoverage] StringLiteral
src/App.tsx:125:11
     element: <Styling3 />,
   },
   {
-    path: "/virtualized-list",
+    path: "",
     element: <VirtualizedListPage />,
   },

[NoCoverage] ObjectLiteral
src/App.tsx:128:3
     path: "/virtualized-list",
     element: <VirtualizedListPage />,
   },
-  {
-    path: "/render-props",
-    element: <RenderPropsPage />,
-  },
+  {},
   {
     path: "/generic-component",

[NoCoverage] StringLiteral
src/App.tsx:129:11
     element: <VirtualizedListPage />,
   },
   {
-    path: "/render-props",
+    path: "",
     element: <RenderPropsPage />,
   },

[NoCoverage] StringLiteral
src/App.tsx:133:11
     element: <RenderPropsPage />,
   },
   {
-    path: "/generic-component",
+    path: "",
     element: <GenericComponent />,
   },

[NoCoverage] ObjectLiteral
src/App.tsx:136:3
     path: "/generic-component",
     element: <GenericComponent />,
   },
-  {
-    path: "/current-date",
-    element: <CurrentDateTestPage />,
-  },
+  {},
   {
     path: "/graphql-subscription",

[NoCoverage] BlockStatement
src/App.tsx:146:16
   },
 ])
 
-function App() {
-  return (
-    <ApolloProvider client={client}>
-      <Layout>
-        <RouterProvider router={router} />
-      </Layout>
-    </ApolloProvider>
-  )
-}
+function App() {}
 
 export default App
