[NoCoverage] BlockStatement
src/components/AddBookForm.tsx:13:42
   const { register, handleSubmit, reset } = useForm<IFormInput>()
   const createBook = useCreateBook()
 
-  const onSubmit = (data: IFormInput) => {
-    createBook.mutate({ title: data.title, author: data.author })
-    reset() // Reset form fields after submission
-  }
+  const onSubmit = (data: IFormInput) => {}
 
   return (
