[NoCoverage] BlockStatement
src/components/BookDetails.tsx:8:62
   bookId: number
 }
 
-export const BookDetails = ({ bookId }: BookDetailsProps) => {
-  const { data: book, isLoading } = useGetSingleBook(bookId)
-
-  if (isLoading) {
-    return <div>Loading...</div>
-  }
-
-  return (
-    <>
-      <div className="p-4 shadow-lg  bg-white">
-        <h2 className="text-xl font-bold mb-4">Book details component</h2>
-        <p className="text-lg">
-          <strong>Title:</strong> {book?.title}
-        </p>
-        <p className="text-lg">
-          <strong>Author:</strong> {book?.author}
-        </p>
-      </div>
-
-      <BookDetailsAnotherComponent bookId={bookId} />
-    </>
-  )
-}
+export const BookDetails = ({ bookId }: BookDetailsProps) => {}
 

[NoCoverage] BlockStatement
src/components/BookDetails.tsx:11:18
 export const BookDetails = ({ bookId }: BookDetailsProps) => {
   const { data: book, isLoading } = useGetSingleBook(bookId)
 
-  if (isLoading) {
-    return <div>Loading...</div>
-  }
+  if (isLoading) {}
 
   return (

[NoCoverage] OptionalChaining
src/components/BookDetails.tsx:20:36
       <div className="p-4 shadow-lg  bg-white">
         <h2 className="text-xl font-bold mb-4">Book details component</h2>
         <p className="text-lg">
-          <strong>Title:</strong> {book?.title}
+          <strong>Title:</strong> {book.title}
         </p>
         <p className="text-lg">

[NoCoverage] OptionalChaining
src/components/BookDetails.tsx:23:37
           <strong>Title:</strong> {book?.title}
         </p>
         <p className="text-lg">
-          <strong>Author:</strong> {book?.author}
+          <strong>Author:</strong> {book.author}
         </p>
       </div>
