[NoCoverage] BlockStatement
src/components/BookDetailsAnotherComponent.tsx:8:94
   bookId: number
 }
 
-export const BookDetailsAnotherComponent = ({ bookId }: BookDetailsAnotherComponentProps) => {
-  const queryClient = useQueryClient()
-  const bookDetails = queryClient.getQueryData<BookType>(["book", bookId])
-
-  if (!bookDetails) {
-    return null
-  }
-
-  return (
-    <div className="p-4 shadow-lg bg-blue-100">
-      <h2 className="text-xl font-bold mb-4">Book details same data in other component (without fetching data)</h2>
-      <p className="text-lg">
-        <strong>Title:</strong> {bookDetails.title}
-      </p>
-      <p className="text-lg">
-        <strong>Author:</strong> {bookDetails.author}
-      </p>
-    </div>
-  )
-}
+export const BookDetailsAnotherComponent = ({ bookId }: BookDetailsAnotherComponentProps) => {}
 

[NoCoverage] ConditionalExpression
src/components/BookDetailsAnotherComponent.tsx:12:7
   const queryClient = useQueryClient()
   const bookDetails = queryClient.getQueryData<BookType>(["book", bookId])
 
-  if (!bookDetails) {
+  if (true) {
     return null
   }

[NoCoverage] BooleanLiteral
src/components/BookDetailsAnotherComponent.tsx:12:7
   const queryClient = useQueryClient()
   const bookDetails = queryClient.getQueryData<BookType>(["book", bookId])
 
-  if (!bookDetails) {
+  if (bookDetails) {
     return null
   }
