[NoCoverage] OptionalChaining
src/components/BookListGraphql/AddBookFormGraphql.tsx:25:29
   const { register, handleSubmit, reset } = useForm<IFormInput>()
   const client = useApolloClient()
   const data = client.readQuery({ query: GET_BOOKS_QUERY })
-  const lastBookId = Number(data?.books[data.books.length - 1]?.id) || 0
+  const lastBookId = Number(data?.books[data.books.length - 1].id) || 0
   const [createBook] = useMutation(CREATE_BOOK_MUTATION, {
     optimisticResponse: {

[NoCoverage] LogicalOperator
src/components/BookListGraphql/AddBookFormGraphql.tsx:25:22
   const { register, handleSubmit, reset } = useForm<IFormInput>()
   const client = useApolloClient()
   const data = client.readQuery({ query: GET_BOOKS_QUERY })
-  const lastBookId = Number(data?.books[data.books.length - 1]?.id) || 0
+  const lastBookId = Number(data?.books[data.books.length - 1]?.id) && 0
   const [createBook] = useMutation(CREATE_BOOK_MUTATION, {
     optimisticResponse: {

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:27:25
   const data = client.readQuery({ query: GET_BOOKS_QUERY })
   const lastBookId = Number(data?.books[data.books.length - 1]?.id) || 0
   const [createBook] = useMutation(CREATE_BOOK_MUTATION, {
-    optimisticResponse: {
-      __typename: "Mutation",
-      createBook: {
-        __typename: "Book",
-        id: "temp-id", // Temporary ID
-        title: "Loading...",
-        author: "Loading...",
-      },
-    },
+    optimisticResponse: {},
     refetchQueries: [{ query: GET_BOOKS_QUERY }], // Refetch book list after creation
     update: (cache, { data: { createBook } }) => {

[NoCoverage] StringLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:28:19
   const lastBookId = Number(data?.books[data.books.length - 1]?.id) || 0
   const [createBook] = useMutation(CREATE_BOOK_MUTATION, {
     optimisticResponse: {
-      __typename: "Mutation",
+      __typename: "",
       createBook: {
         __typename: "Book",

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:29:19
   const [createBook] = useMutation(CREATE_BOOK_MUTATION, {
     optimisticResponse: {
       __typename: "Mutation",
-      createBook: {
-        __typename: "Book",
-        id: "temp-id", // Temporary ID
-        title: "Loading...",
-        author: "Loading...",
-      },
+      createBook: {},
     },
     refetchQueries: [{ query: GET_BOOKS_QUERY }], // Refetch book list after creation

[NoCoverage] StringLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:31:13
       __typename: "Mutation",
       createBook: {
         __typename: "Book",
-        id: "temp-id", // Temporary ID
+        id: "", // Temporary ID
         title: "Loading...",
         author: "Loading...",

[NoCoverage] StringLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:32:16
       createBook: {
         __typename: "Book",
         id: "temp-id", // Temporary ID
-        title: "Loading...",
+        title: "",
         author: "Loading...",
       },

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:36:22
         author: "Loading...",
       },
     },
-    refetchQueries: [{ query: GET_BOOKS_QUERY }], // Refetch book list after creation
+    refetchQueries: [{}], // Refetch book list after creation
     update: (cache, { data: { createBook } }) => {
       // Read the current state of the query from the cache

[NoCoverage] BlockStatement
src/components/BookListGraphql/AddBookFormGraphql.tsx:37:50
       },
     },
     refetchQueries: [{ query: GET_BOOKS_QUERY }], // Refetch book list after creation
-    update: (cache, { data: { createBook } }) => {
-      // Read the current state of the query from the cache
-      const existingBooks = cache.readQuery({ query: GET_BOOKS_QUERY }) as { books: BookType[] }
-      // Add the new book to the cache
-      const newBooks = existingBooks ? [...existingBooks.books, createBook] : [createBook]
-      // Write the updated books list back to the cache
-      cache.writeQuery({
-        query: GET_BOOKS_QUERY,
-        data: { books: newBooks },
-      })
-    },
+    update: (cache, { data: { createBook } }) => {},
   })
 

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:43:24
       // Add the new book to the cache
       const newBooks = existingBooks ? [...existingBooks.books, createBook] : [createBook]
       // Write the updated books list back to the cache
-      cache.writeQuery({
-        query: GET_BOOKS_QUERY,
-        data: { books: newBooks },
-      })
+      cache.writeQuery({})
     },
   })

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:45:15
       // Write the updated books list back to the cache
       cache.writeQuery({
         query: GET_BOOKS_QUERY,
-        data: { books: newBooks },
+        data: {},
       })
     },

[NoCoverage] BlockStatement
src/components/BookListGraphql/AddBookFormGraphql.tsx:50:42
     },
   })
 
-  const onSubmit = (data: IFormInput) => {
-    createBook({
-      variables: { title: data.title, author: data.author },
-      optimisticResponse: {
-        createBook: {
-          __typename: "Book",
-          id: lastBookId + 1,
-          title: data.title,
-          author: data.author,
-        },
-      },
-    })
-    reset() // Reset form fields after submission
-  }
+  const onSubmit = (data: IFormInput) => {}
 
   return (

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:51:16
   })
 
   const onSubmit = (data: IFormInput) => {
-    createBook({
-      variables: { title: data.title, author: data.author },
-      optimisticResponse: {
-        createBook: {
-          __typename: "Book",
-          id: lastBookId + 1,
-          title: data.title,
-          author: data.author,
-        },
-      },
-    })
+    createBook({})
     reset() // Reset form fields after submission
   }

[NoCoverage] ArithmeticOperator
src/components/BookListGraphql/AddBookFormGraphql.tsx:56:15
       optimisticResponse: {
         createBook: {
           __typename: "Book",
-          id: lastBookId + 1,
+          id: lastBookId - 1,
           title: data.title,
           author: data.author,

[NoCoverage] StringLiteral
src/components/BookListGraphql/AddBookFormGraphql.tsx:75:22
         className="border-2 border-gray-300 p-2 rounded-md focus:outline-none focus:border-blue-500 w-full"
       />
       <input
-        {...register("author")}
+        {...register("")}
         type="text"
         placeholder="Author"
