[NoCoverage] BooleanLiteral
src/components/BookListGraphql/BookDetailsGraphql.tsx:49:36
   })
 
   const { data: dataInclude } = useQuery(GET_BOOK_DETAILS_INCLUDE, {
-    variables: { includeFirstBook: true, includeSecondBook: false },
+    variables: { includeFirstBook: false, includeSecondBook: false },
   })
 

[NoCoverage] BooleanLiteral
src/components/BookListGraphql/BookDetailsGraphql.tsx:49:61
   })
 
   const { data: dataInclude } = useQuery(GET_BOOK_DETAILS_INCLUDE, {
-    variables: { includeFirstBook: true, includeSecondBook: false },
+    variables: { includeFirstBook: true, includeSecondBook: true },
   })
 

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:54:7
 
   const { data: dataTwoBooks, error: errorTwoBooks } = useQuery(GET_BOOK_DETAILS_TWO_BOOKS)
 
-  if (loading) return <p>Loading...</p>
+  if (false) return <p>Loading...</p>
   if (error || errorTwoBooks) return <p>Error</p>
 

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:54:7
 
   const { data: dataTwoBooks, error: errorTwoBooks } = useQuery(GET_BOOK_DETAILS_TWO_BOOKS)
 
-  if (loading) return <p>Loading...</p>
+  if (true) return <p>Loading...</p>
   if (error || errorTwoBooks) return <p>Error</p>
 

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:55:7
   const { data: dataTwoBooks, error: errorTwoBooks } = useQuery(GET_BOOK_DETAILS_TWO_BOOKS)
 
   if (loading) return <p>Loading...</p>
-  if (error || errorTwoBooks) return <p>Error</p>
+  if (false) return <p>Error</p>
 
   return (

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:55:7
   const { data: dataTwoBooks, error: errorTwoBooks } = useQuery(GET_BOOK_DETAILS_TWO_BOOKS)
 
   if (loading) return <p>Loading...</p>
-  if (error || errorTwoBooks) return <p>Error</p>
+  if (true) return <p>Error</p>
 
   return (

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:70:8
       </div>
 
       <h3>ALIAS</h3>
-      {dataTwoBooks && (
-        <div className="p-4 shadow-lg bg-white">
-          <h2 className="text-xl font-bold mb-4">Book details (GraphQL)</h2>
-          <h3 className="text-lg font-bold">First Book:</h3>
-          <p className="text-lg">
-            <strong>Title:</strong> {dataTwoBooks.firstBook.title}
-          </p>
-          <p className="text-lg">
-            <strong>Author:</strong> {dataTwoBooks.firstBook.author}
-          </p>
-          <h3 className="text-lg font-bold">Second Book:</h3>
-          <p className="text-lg">
-            <strong>Title:</strong> {dataTwoBooks.secondBook.title}
-          </p>
-          <p className="text-lg">
-            <strong>Author:</strong> {dataTwoBooks.secondBook.author}
-          </p>
-        </div>
-      )}
+      {true}
       <h3>INCLUDE</h3>
       {dataInclude && (

[NoCoverage] LogicalOperator
src/components/BookListGraphql/BookDetailsGraphql.tsx:70:8
       </div>
 
       <h3>ALIAS</h3>
-      {dataTwoBooks && (
-        <div className="p-4 shadow-lg bg-white">
-          <h2 className="text-xl font-bold mb-4">Book details (GraphQL)</h2>
-          <h3 className="text-lg font-bold">First Book:</h3>
-          <p className="text-lg">
-            <strong>Title:</strong> {dataTwoBooks.firstBook.title}
-          </p>
-          <p className="text-lg">
-            <strong>Author:</strong> {dataTwoBooks.firstBook.author}
-          </p>
-          <h3 className="text-lg font-bold">Second Book:</h3>
-          <p className="text-lg">
-            <strong>Title:</strong> {dataTwoBooks.secondBook.title}
-          </p>
-          <p className="text-lg">
-            <strong>Author:</strong> {dataTwoBooks.secondBook.author}
-          </p>
-        </div>
-      )}
+      {dataTwoBooks || <div className="p-4 shadow-lg bg-white">
+          <h2 className="text-xl font-bold mb-4">Book details (GraphQL)</h2>
+          <h3 className="text-lg font-bold">First Book:</h3>
+          <p className="text-lg">
+            <strong>Title:</strong> {dataTwoBooks.firstBook.title}
+          </p>
+          <p className="text-lg">
+            <strong>Author:</strong> {dataTwoBooks.firstBook.author}
+          </p>
+          <h3 className="text-lg font-bold">Second Book:</h3>
+          <p className="text-lg">
+            <strong>Title:</strong> {dataTwoBooks.secondBook.title}
+          </p>
+          <p className="text-lg">
+            <strong>Author:</strong> {dataTwoBooks.secondBook.author}
+          </p>
+        </div>}
       <h3>INCLUDE</h3>
       {dataInclude && (

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:93:12
       {dataInclude && (
         <div className="p-4 shadow-lg bg-white">
           <h2 className="text-xl font-bold mb-4">Book details (GraphQL)</h2>
-          {dataInclude?.firstBook && (
-            <>
-              <h3 className="text-lg font-bold">First Book:</h3>
-              <p className="text-lg">
-                <strong>Title:</strong> {dataInclude.firstBook.title}
-              </p>
-              <p className="text-lg">
-                <strong>Author:</strong> {dataInclude.firstBook.author}
-              </p>
-            </>
-          )}
+          {false}
           {dataInclude?.secondBook && (
             <>

[NoCoverage] LogicalOperator
src/components/BookListGraphql/BookDetailsGraphql.tsx:93:12
       {dataInclude && (
         <div className="p-4 shadow-lg bg-white">
           <h2 className="text-xl font-bold mb-4">Book details (GraphQL)</h2>
-          {dataInclude?.firstBook && (
-            <>
-              <h3 className="text-lg font-bold">First Book:</h3>
-              <p className="text-lg">
-                <strong>Title:</strong> {dataInclude.firstBook.title}
-              </p>
-              <p className="text-lg">
-                <strong>Author:</strong> {dataInclude.firstBook.author}
-              </p>
-            </>
-          )}
+          {dataInclude?.firstBook || <>
+              <h3 className="text-lg font-bold">First Book:</h3>
+              <p className="text-lg">
+                <strong>Title:</strong> {dataInclude.firstBook.title}
+              </p>
+              <p className="text-lg">
+                <strong>Author:</strong> {dataInclude.firstBook.author}
+              </p>
+            </>}
           {dataInclude?.secondBook && (
             <>

[NoCoverage] LogicalOperator
src/components/BookListGraphql/BookDetailsGraphql.tsx:104:12
               </p>
             </>
           )}
-          {dataInclude?.secondBook && (
-            <>
-              <h3 className="text-lg font-bold">Second Book:</h3>
-              <p className="text-lg">
-                <strong>Title:</strong> {dataInclude.secondBook.title}
-              </p>
-              <p className="text-lg">
-                <strong>Author:</strong> {dataInclude.secondBook.author}
-              </p>
-            </>
-          )}
+          {dataInclude?.secondBook || <>
+              <h3 className="text-lg font-bold">Second Book:</h3>
+              <p className="text-lg">
+                <strong>Title:</strong> {dataInclude.secondBook.title}
+              </p>
+              <p className="text-lg">
+                <strong>Author:</strong> {dataInclude.secondBook.author}
+              </p>
+            </>}
         </div>
       )}

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookDetailsGraphql.tsx:104:12
               </p>
             </>
           )}
-          {dataInclude?.secondBook && (
-            <>
-              <h3 className="text-lg font-bold">Second Book:</h3>
-              <p className="text-lg">
-                <strong>Title:</strong> {dataInclude.secondBook.title}
-              </p>
-              <p className="text-lg">
-                <strong>Author:</strong> {dataInclude.secondBook.author}
-              </p>
-            </>
-          )}
+          {false}
         </div>
       )}
