[NoCoverage] ObjectLiteral
src/components/BookListGraphql/BookListGraphql.tsx:26:58
 
 export const BookListGraphql = () => {
   const { data, loading, error } = useQuery(GET_BOOKS_QUERY)
-  const [deleteBook] = useMutation(DELETE_BOOK_MUTATION, {
-    refetchQueries: [{ query: GET_BOOKS_QUERY }],
-    optimisticResponse: {
-      __typename: "Mutation",
-      deleteBook: {
-        __typename: "Book",
-        id: "", // We don't know the ID yet, but Apollo needs something
-      },
-    },
-    update: (cache, { data: { deleteBook } }) => {
-      const existingBooks = cache.readQuery({ query: GET_BOOKS_QUERY }) as { books: BookType[] }
-      const newBooks = existingBooks.books.filter((book: BookType) => book.id !== deleteBook.id)
-      cache.writeQuery({ query: GET_BOOKS_QUERY, data: { books: newBooks } })
-    },
-  })
+  const [deleteBook] = useMutation(DELETE_BOOK_MUTATION, {})
   const navigate = useNavigate()
 

[NoCoverage] ArrayDeclaration
src/components/BookListGraphql/BookListGraphql.tsx:27:21
 export const BookListGraphql = () => {
   const { data, loading, error } = useQuery(GET_BOOKS_QUERY)
   const [deleteBook] = useMutation(DELETE_BOOK_MUTATION, {
-    refetchQueries: [{ query: GET_BOOKS_QUERY }],
+    refetchQueries: [],
     optimisticResponse: {
       __typename: "Mutation",

[NoCoverage] StringLiteral
src/components/BookListGraphql/BookListGraphql.tsx:31:21
     optimisticResponse: {
       __typename: "Mutation",
       deleteBook: {
-        __typename: "Book",
+        __typename: "",
         id: "", // We don't know the ID yet, but Apollo needs something
       },

[NoCoverage] StringLiteral
src/components/BookListGraphql/BookListGraphql.tsx:32:13
       __typename: "Mutation",
       deleteBook: {
         __typename: "Book",
-        id: "", // We don't know the ID yet, but Apollo needs something
+        id: "Stryker was here!", // We don't know the ID yet, but Apollo needs something
       },
     },

[NoCoverage] BlockStatement
src/components/BookListGraphql/BookListGraphql.tsx:35:50
         id: "", // We don't know the ID yet, but Apollo needs something
       },
     },
-    update: (cache, { data: { deleteBook } }) => {
-      const existingBooks = cache.readQuery({ query: GET_BOOKS_QUERY }) as { books: BookType[] }
-      const newBooks = existingBooks.books.filter((book: BookType) => book.id !== deleteBook.id)
-      cache.writeQuery({ query: GET_BOOKS_QUERY, data: { books: newBooks } })
-    },
+    update: (cache, { data: { deleteBook } }) => {},
   })
   const navigate = useNavigate()

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:37:71
     },
     update: (cache, { data: { deleteBook } }) => {
       const existingBooks = cache.readQuery({ query: GET_BOOKS_QUERY }) as { books: BookType[] }
-      const newBooks = existingBooks.books.filter((book: BookType) => book.id !== deleteBook.id)
+      const newBooks = existingBooks.books.filter((book: BookType) => true)
       cache.writeQuery({ query: GET_BOOKS_QUERY, data: { books: newBooks } })
     },

[NoCoverage] MethodExpression
src/components/BookListGraphql/BookListGraphql.tsx:37:24
     },
     update: (cache, { data: { deleteBook } }) => {
       const existingBooks = cache.readQuery({ query: GET_BOOKS_QUERY }) as { books: BookType[] }
-      const newBooks = existingBooks.books.filter((book: BookType) => book.id !== deleteBook.id)
+      const newBooks = existingBooks.books
       cache.writeQuery({ query: GET_BOOKS_QUERY, data: { books: newBooks } })
     },

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:43:7
   })
   const navigate = useNavigate()
 
-  if (loading) return <div>Loading...</div>
+  if (false) return <div>Loading...</div>
   if (error) return <div>Error loading books.</div>
 

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:43:7
   })
   const navigate = useNavigate()
 
-  if (loading) return <div>Loading...</div>
+  if (true) return <div>Loading...</div>
   if (error) return <div>Error loading books.</div>
 

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:44:7
   const navigate = useNavigate()
 
   if (loading) return <div>Loading...</div>
-  if (error) return <div>Error loading books.</div>
+  if (false) return <div>Error loading books.</div>
 
   const handleDelete = (id: number) => {

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:44:7
   const navigate = useNavigate()
 
   if (loading) return <div>Loading...</div>
-  if (error) return <div>Error loading books.</div>
+  if (true) return <div>Error loading books.</div>
 
   const handleDelete = (id: number) => {

[NoCoverage] BlockStatement
src/components/BookListGraphql/BookListGraphql.tsx:46:40
   if (loading) return <div>Loading...</div>
   if (error) return <div>Error loading books.</div>
 
-  const handleDelete = (id: number) => {
-    deleteBook({ variables: { id }, optimisticResponse: { deleteBook: { id, __typename: "Book" } } })
-  }
+  const handleDelete = (id: number) => {}
 
   const navigateToBookDetails = (id: number) => {

[NoCoverage] ObjectLiteral
src/components/BookListGraphql/BookListGraphql.tsx:47:29
   if (error) return <div>Error loading books.</div>
 
   const handleDelete = (id: number) => {
-    deleteBook({ variables: { id }, optimisticResponse: { deleteBook: { id, __typename: "Book" } } })
+    deleteBook({ variables: {}, optimisticResponse: { deleteBook: { id, __typename: "Book" } } })
   }
 

[NoCoverage] BlockStatement
src/components/BookListGraphql/BookListGraphql.tsx:50:49
     deleteBook({ variables: { id }, optimisticResponse: { deleteBook: { id, __typename: "Book" } } })
   }
 
-  const navigateToBookDetails = (id: number) => {
-    navigate(`/book-graphql/${id}`)
-  }
+  const navigateToBookDetails = (id: number) => {}
 
   return (

[NoCoverage] StringLiteral
src/components/BookListGraphql/BookListGraphql.tsx:51:14
   }
 
   const navigateToBookDetails = (id: number) => {
-    navigate(`/book-graphql/${id}`)
+    navigate(``)
   }
 

[NoCoverage] EqualityOperator
src/components/BookListGraphql/BookListGraphql.tsx:66:10
             <th className="px-4 py-2">Details</th>
           </tr>
         </thead>
-        {data.books.length > 0 && (
+        {data.books.length <= 0 && (
           <tbody data-cy="book-list">
             {data?.books?.map((book: BookType) => (

[NoCoverage] ConditionalExpression
src/components/BookListGraphql/BookListGraphql.tsx:66:10
             <th className="px-4 py-2">Details</th>
           </tr>
         </thead>
-        {data.books.length > 0 && (
+        {true && (
           <tbody data-cy="book-list">
             {data?.books?.map((book: BookType) => (

[NoCoverage] OptionalChaining
src/components/BookListGraphql/BookListGraphql.tsx:68:14
         </thead>
         {data.books.length > 0 && (
           <tbody data-cy="book-list">
-            {data?.books?.map((book: BookType) => (
+            {data.books?.map((book: BookType) => (
               <tr key={book.id}>
                 <td className="border px-4 py-2">{book.id}</td>

[NoCoverage] OptionalChaining
src/components/BookListGraphql/BookListGraphql.tsx:68:14
         </thead>
         {data.books.length > 0 && (
           <tbody data-cy="book-list">
-            {data?.books?.map((book: BookType) => (
+            {data?.books.map((book: BookType) => (
               <tr key={book.id}>
                 <td className="border px-4 py-2">{book.id}</td>
