[NoCoverage] ObjectLiteral
src/components/ComplicatedForm.tsx:5:32
 import { z } from "zod"
 import { zodResolver } from "@hookform/resolvers/zod"
 
-const addressSchema = z.object({
-  city: z.string().refine((value) => value.length > 0, "City is required!"),
-  zipCode: z
-    .string()
-    .refine((value) => value.length > 0, "Zip code is required!")
-    .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
-  street: z.string().refine((value) => value.length > 0, "Street name is required!"),
-})
+const addressSchema = z.object({})
 
 const formSchema = z.object({

[NoCoverage] EqualityOperator
src/components/ComplicatedForm.tsx:6:38
 import { zodResolver } from "@hookform/resolvers/zod"
 
 const addressSchema = z.object({
-  city: z.string().refine((value) => value.length > 0, "City is required!"),
+  city: z.string().refine((value) => value.length <= 0, "City is required!"),
   zipCode: z
     .string()

[NoCoverage] ArrowFunction
src/components/ComplicatedForm.tsx:6:27
 import { zodResolver } from "@hookform/resolvers/zod"
 
 const addressSchema = z.object({
-  city: z.string().refine((value) => value.length > 0, "City is required!"),
+  city: z.string().refine(() => undefined, "City is required!"),
   zipCode: z
     .string()

[NoCoverage] ArrowFunction
src/components/ComplicatedForm.tsx:9:13
   city: z.string().refine((value) => value.length > 0, "City is required!"),
   zipCode: z
     .string()
-    .refine((value) => value.length > 0, "Zip code is required!")
+    .refine(() => undefined, "Zip code is required!")
     .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
   street: z.string().refine((value) => value.length > 0, "Street name is required!"),

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:9:24
   city: z.string().refine((value) => value.length > 0, "City is required!"),
   zipCode: z
     .string()
-    .refine((value) => value.length > 0, "Zip code is required!")
+    .refine((value) => false, "Zip code is required!")
     .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
   street: z.string().refine((value) => value.length > 0, "Street name is required!"),

[NoCoverage] ArrowFunction
src/components/ComplicatedForm.tsx:10:13
   zipCode: z
     .string()
     .refine((value) => value.length > 0, "Zip code is required!")
-    .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
+    .refine(() => undefined, "Zip code must be in xx-xxx format"),
   street: z.string().refine((value) => value.length > 0, "Street name is required!"),
 })

[NoCoverage] StringLiteral
src/components/ComplicatedForm.tsx:10:53
   zipCode: z
     .string()
     .refine((value) => value.length > 0, "Zip code is required!")
-    .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
+    .refine((value) => /^\d{2}-\d{3}$/.test(value), ""),
   street: z.string().refine((value) => value.length > 0, "Street name is required!"),
 })

[NoCoverage] EqualityOperator
src/components/ComplicatedForm.tsx:11:40
     .string()
     .refine((value) => value.length > 0, "Zip code is required!")
     .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
-  street: z.string().refine((value) => value.length > 0, "Street name is required!"),
+  street: z.string().refine((value) => value.length <= 0, "Street name is required!"),
 })
 

[NoCoverage] EqualityOperator
src/components/ComplicatedForm.tsx:11:40
     .string()
     .refine((value) => value.length > 0, "Zip code is required!")
     .refine((value) => /^\d{2}-\d{3}$/.test(value), "Zip code must be in xx-xxx format"),
-  street: z.string().refine((value) => value.length > 0, "Street name is required!"),
+  street: z.string().refine((value) => value.length >= 0, "Street name is required!"),
 })
 

[NoCoverage] ObjectLiteral
src/components/ComplicatedForm.tsx:27:27
     handleSubmit,
     reset,
     formState: { errors },
-  } = useForm<FormValues>({
-    defaultValues: {
-      addresses: [{ city: "", zipCode: "", street: "" }],
-    },
-    resolver: zodResolver(formSchema),
-  })
+  } = useForm<FormValues>({})
 
   const { fields, append, remove } = useFieldArray({

[NoCoverage] ObjectLiteral
src/components/ComplicatedForm.tsx:29:19
     formState: { errors },
   } = useForm<FormValues>({
     defaultValues: {
-      addresses: [{ city: "", zipCode: "", street: "" }],
+      addresses: [{}],
     },
     resolver: zodResolver(formSchema),

[NoCoverage] ObjectLiteral
src/components/ComplicatedForm.tsx:34:52
     resolver: zodResolver(formSchema),
   })
 
-  const { fields, append, remove } = useFieldArray({
-    control,
-    name: "addresses",
-  })
+  const { fields, append, remove } = useFieldArray({})
 
   const onSubmit = (data: FormValues) => {

[NoCoverage] StringLiteral
src/components/ComplicatedForm.tsx:36:11
 
   const { fields, append, remove } = useFieldArray({
     control,
-    name: "addresses",
+    name: "",
   })
 

[NoCoverage] BlockStatement
src/components/ComplicatedForm.tsx:39:42
     name: "addresses",
   })
 
-  const onSubmit = (data: FormValues) => {
-    console.log(data)
-  }
+  const onSubmit = (data: FormValues) => {}
 
   const handleAddNewRow = () => {

[NoCoverage] BlockStatement
src/components/ComplicatedForm.tsx:43:33
     console.log(data)
   }
 
-  const handleAddNewRow = () => {
-    append({ city: "", zipCode: "", street: "" })
-  }
+  const handleAddNewRow = () => {}
 
   const handleReset = () => {

[NoCoverage] StringLiteral
src/components/ComplicatedForm.tsx:44:45
   }
 
   const handleAddNewRow = () => {
-    append({ city: "", zipCode: "", street: "" })
+    append({ city: "", zipCode: "", street: "Stryker was here!" })
   }
 

[NoCoverage] BlockStatement
src/components/ComplicatedForm.tsx:47:29
     append({ city: "", zipCode: "", street: "" })
   }
 
-  const handleReset = () => {
-    reset({
-      addresses: [{ city: "", zipCode: "", street: "" }],
-    })
-  }
+  const handleReset = () => {}
 
   return (

[NoCoverage] StringLiteral
src/components/ComplicatedForm.tsx:49:40
 
   const handleReset = () => {
     reset({
-      addresses: [{ city: "", zipCode: "", street: "" }],
+      addresses: [{ city: "", zipCode: "Stryker was here!", street: "" }],
     })
   }

[NoCoverage] ArrayDeclaration
src/components/ComplicatedForm.tsx:49:18
 
   const handleReset = () => {
     reset({
-      addresses: [{ city: "", zipCode: "", street: "" }],
+      addresses: [],
     })
   }

[NoCoverage] StringLiteral
src/components/ComplicatedForm.tsx:61:37
           <div key={item.id} className="flex flex-col mb-2">
             <fieldset className="flex gap-2 items-center">
               <div className="flex flex-col">
-                <input {...register(`addresses.${index}.city`)} placeholder="City" className="py-2 px-4 rounded-md" />
+                <input {...register(``)} placeholder="City" className="py-2 px-4 rounded-md" />
                 {errors.addresses?.[index]?.city && (
                   <p className="text-red-500">{errors?.addresses?.[index]?.city?.message}</p>

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:62:18
             <fieldset className="flex gap-2 items-center">
               <div className="flex flex-col">
                 <input {...register(`addresses.${index}.city`)} placeholder="City" className="py-2 px-4 rounded-md" />
-                {errors.addresses?.[index]?.city && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.city?.message}</p>
-                )}
+                {false}
               </div>
               <div className="flex flex-col">

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:62:18
             <fieldset className="flex gap-2 items-center">
               <div className="flex flex-col">
                 <input {...register(`addresses.${index}.city`)} placeholder="City" className="py-2 px-4 rounded-md" />
-                {errors.addresses?.[index]?.city && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.city?.message}</p>
-                )}
+                {true}
               </div>
               <div className="flex flex-col">

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:63:48
               <div className="flex flex-col">
                 <input {...register(`addresses.${index}.city`)} placeholder="City" className="py-2 px-4 rounded-md" />
                 {errors.addresses?.[index]?.city && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.city?.message}</p>
+                  <p className="text-red-500">{errors?.addresses?.[index].city?.message}</p>
                 )}
               </div>

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:63:48
               <div className="flex flex-col">
                 <input {...register(`addresses.${index}.city`)} placeholder="City" className="py-2 px-4 rounded-md" />
                 {errors.addresses?.[index]?.city && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.city?.message}</p>
+                  <p className="text-red-500">{errors?.addresses?.[index]?.city.message}</p>
                 )}
               </div>

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:72:18
                   placeholder="Zip Code"
                   className="py-2 px-4 rounded-md"
                 />
-                {errors.addresses?.[index]?.zipCode && (
+                {errors.addresses[index]?.zipCode && (
                   <p className="text-red-500">{errors?.addresses?.[index]?.zipCode?.message}</p>
                 )}

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:72:18
                   placeholder="Zip Code"
                   className="py-2 px-4 rounded-md"
                 />
-                {errors.addresses?.[index]?.zipCode && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.zipCode?.message}</p>
-                )}
+                {true}
               </div>
               <div className="flex flex-col">

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:73:48
                   className="py-2 px-4 rounded-md"
                 />
                 {errors.addresses?.[index]?.zipCode && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.zipCode?.message}</p>
+                  <p className="text-red-500">{errors.addresses?.[index]?.zipCode?.message}</p>
                 )}
               </div>

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:73:48
                   className="py-2 px-4 rounded-md"
                 />
                 {errors.addresses?.[index]?.zipCode && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.zipCode?.message}</p>
+                  <p className="text-red-500">{errors?.addresses?.[index]?.zipCode.message}</p>
                 )}
               </div>

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:82:18
                   placeholder="Street"
                   className="py-2 px-4 rounded-md"
                 />
-                {errors.addresses?.[index]?.street && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
-                )}
+                {true}
               </div>
               {index > 0 && (

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:82:18
                   placeholder="Street"
                   className="py-2 px-4 rounded-md"
                 />
-                {errors.addresses?.[index]?.street && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
-                )}
+                {false}
               </div>
               {index > 0 && (

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:83:48
                   className="py-2 px-4 rounded-md"
                 />
                 {errors.addresses?.[index]?.street && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
+                  <p className="text-red-500">{errors?.addresses?.[index]?.street.message}</p>
                 )}
               </div>

[NoCoverage] OptionalChaining
src/components/ComplicatedForm.tsx:83:48
                   className="py-2 px-4 rounded-md"
                 />
                 {errors.addresses?.[index]?.street && (
-                  <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
+                  <p className="text-red-500">{errors.addresses?.[index]?.street?.message}</p>
                 )}
               </div>

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:86:16
                   <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
                 )}
               </div>
-              {index > 0 && (
-                <button
-                  type="button"
-                  className="bg-red-500 hover:bg-red-700 text-white font-bold py-2 px-4 rounded-md"
-                  onClick={() => remove(index)}
-                >
-                  Remove
-                </button>
-              )}
+              {false}
             </fieldset>
           </div>

[NoCoverage] ConditionalExpression
src/components/ComplicatedForm.tsx:86:16
                   <p className="text-red-500">{errors?.addresses?.[index]?.street?.message}</p>
                 )}
               </div>
-              {index > 0 && (
-                <button
-                  type="button"
-                  className="bg-red-500 hover:bg-red-700 text-white font-bold py-2 px-4 rounded-md"
-                  onClick={() => remove(index)}
-                >
-                  Remove
-                </button>
-              )}
+              {true}
             </fieldset>
           </div>

[NoCoverage] ArrowFunction
src/components/ComplicatedForm.tsx:90:28
                 <button
                   type="button"
                   className="bg-red-500 hover:bg-red-700 text-white font-bold py-2 px-4 rounded-md"
-                  onClick={() => remove(index)}
+                  onClick={() => undefined}
                 >
                   Remove
