[NoCoverage] BlockStatement
src/components/Header.tsx:1:29
-export const Header = () => {
-  const methodDoesNotExist = () => {
-    throw new Error("Method does not exist")
-  }
-
-  return (
-    <div className="p-2 bg-white">
-      <h1 className="text-2xl font-bold">
-        <a href="/">Dev path &lt;/&gt; </a>
-      </h1>
-      <button onClick={() => methodDoesNotExist()}>Break the world</button>;
-    </div>
-  )
-}
+export const Header = () => {}
 

[NoCoverage] BlockStatement
src/components/Header.tsx:2:36
 export const Header = () => {
-  const methodDoesNotExist = () => {
-    throw new Error("Method does not exist")
-  }
+  const methodDoesNotExist = () => {}
 
   return (

[NoCoverage] ArrowFunction
src/components/Header.tsx:11:24
       <h1 className="text-2xl font-bold">
         <a href="/">Dev path &lt;/&gt; </a>
       </h1>
-      <button onClick={() => methodDoesNotExist()}>Break the world</button>;
+      <button onClick={() => undefined}>Break the world</button>;
     </div>
   )
