[NoCoverage] BlockStatement
src/components/IntervalComponent.tsx:7:80
   initialCount: number
 }
 
-export const IntervalComponent = ({ initialCount }: IntervalComponentProps) => {
-  const [counter, setCounter] = useState(initialCount)
-  useEffect(() => {
-    const intervalId = setInterval(() => {
-      setCounter((prevCount) => prevCount + 1)
-    }, 1000)
-
-    // This function will be called when the component unmounts or when props change
-    return () => {
-      clearInterval(intervalId)
-    }
-  }, [initialCount])
-  return <div className="text-center text-4xl">{counter}</div>
-}
+export const IntervalComponent = ({ initialCount }: IntervalComponentProps) => {}
 

[NoCoverage] BlockStatement
src/components/IntervalComponent.tsx:9:19
 
 export const IntervalComponent = ({ initialCount }: IntervalComponentProps) => {
   const [counter, setCounter] = useState(initialCount)
-  useEffect(() => {
-    const intervalId = setInterval(() => {
-      setCounter((prevCount) => prevCount + 1)
-    }, 1000)
-
-    // This function will be called when the component unmounts or when props change
-    return () => {
-      clearInterval(intervalId)
-    }
-  }, [initialCount])
+  useEffect(() => {}, [initialCount])
   return <div className="text-center text-4xl">{counter}</div>
 }

[NoCoverage] BlockStatement
src/components/IntervalComponent.tsx:10:42
 export const IntervalComponent = ({ initialCount }: IntervalComponentProps) => {
   const [counter, setCounter] = useState(initialCount)
   useEffect(() => {
-    const intervalId = setInterval(() => {
-      setCounter((prevCount) => prevCount + 1)
-    }, 1000)
+    const intervalId = setInterval(() => {}, 1000)
 
     // This function will be called when the component unmounts or when props change

[NoCoverage] ArrowFunction
src/components/IntervalComponent.tsx:11:18
   const [counter, setCounter] = useState(initialCount)
   useEffect(() => {
     const intervalId = setInterval(() => {
-      setCounter((prevCount) => prevCount + 1)
+      setCounter(() => undefined)
     }, 1000)
 

[NoCoverage] ArithmeticOperator
src/components/IntervalComponent.tsx:11:33
   const [counter, setCounter] = useState(initialCount)
   useEffect(() => {
     const intervalId = setInterval(() => {
-      setCounter((prevCount) => prevCount + 1)
+      setCounter((prevCount) => prevCount - 1)
     }, 1000)
 

[NoCoverage] BlockStatement
src/components/IntervalComponent.tsx:15:18
     }, 1000)
 
     // This function will be called when the component unmounts or when props change
-    return () => {
-      clearInterval(intervalId)
-    }
+    return () => {}
   }, [initialCount])
   return <div className="text-center text-4xl">{counter}</div>
