[NoCoverage] BlockStatement
src/components/SharedCounter.tsx:7:72
   render: (sharedData: { count: number; increment: () => void }) => JSX.Element
 }
 
-export const SharedCounter = ({ render }: SharedFunctionalityProps) => {
-  const [count, setCount] = React.useState(0)
-
-  const increment = () => setCount((prevCount) => prevCount + 1)
-
-  return render({ count, increment })
-}
+export const SharedCounter = ({ render }: SharedFunctionalityProps) => {}
 

[NoCoverage] ArrowFunction
src/components/SharedCounter.tsx:10:36
 export const SharedCounter = ({ render }: SharedFunctionalityProps) => {
   const [count, setCount] = React.useState(0)
 
-  const increment = () => setCount((prevCount) => prevCount + 1)
+  const increment = () => setCount(() => undefined)
 
   return render({ count, increment })

[NoCoverage] ArithmeticOperator
src/components/SharedCounter.tsx:10:51
 export const SharedCounter = ({ render }: SharedFunctionalityProps) => {
   const [count, setCount] = React.useState(0)
 
-  const increment = () => setCount((prevCount) => prevCount + 1)
+  const increment = () => setCount((prevCount) => prevCount - 1)
 
   return render({ count, increment })

[NoCoverage] ObjectLiteral
src/components/SharedCounter.tsx:12:17
 
   const increment = () => setCount((prevCount) => prevCount + 1)
 
-  return render({ count, increment })
+  return render({})
 }
 
