[NoCoverage] ArrowFunction
src/components/VirtualizedList/VirtualizedList.tsx:13:23
 
   const rowVirtualizer = useVirtualizer({
     count: items.length,
-    getScrollElement: () => parentRef.current,
+    getScrollElement: () => undefined,
     estimateSize: () => 24,
   })

[NoCoverage] ArrowFunction
src/components/VirtualizedList/VirtualizedList.tsx:14:19
   const rowVirtualizer = useVirtualizer({
     count: items.length,
     getScrollElement: () => parentRef.current,
-    estimateSize: () => 24,
+    estimateSize: () => undefined,
   })
 

[NoCoverage] ObjectLiteral
src/components/VirtualizedList/VirtualizedList.tsx:20:49
   return (
     <div ref={parentRef} className="h-[400px] w-full overflow-auto bg-blue-500">
       <h2>Virtualized list</h2>
-      <div className={`relative w-full`} style={{ height: `${rowVirtualizer.getTotalSize()}px` }}>
+      <div className={`relative w-full`} style={{}}>
         {rowVirtualizer.getVirtualItems().map((virtualItem) => (
           <div

[NoCoverage] ArrowFunction
src/components/VirtualizedList/VirtualizedList.tsx:21:47
     <div ref={parentRef} className="h-[400px] w-full overflow-auto bg-blue-500">
       <h2>Virtualized list</h2>
       <div className={`relative w-full`} style={{ height: `${rowVirtualizer.getTotalSize()}px` }}>
-        {rowVirtualizer.getVirtualItems().map((virtualItem) => (
-          <div
-            key={virtualItem.index}
-            className={`w-full absolute top-0 left-0`}
-            style={{
-              height: `${virtualItem.size}px`,
-              transform: `translateY(${virtualItem.start}px)`,
-            }}
-          >
-            {items[virtualItem.index]}
-          </div>
-        ))}
+        {rowVirtualizer.getVirtualItems().map(() => undefined)}
       </div>
     </div>

[NoCoverage] StringLiteral
src/components/VirtualizedList/VirtualizedList.tsx:24:24
         {rowVirtualizer.getVirtualItems().map((virtualItem) => (
           <div
             key={virtualItem.index}
-            className={`w-full absolute top-0 left-0`}
+            className={``}
             style={{
               height: `${virtualItem.size}px`,
