[NoCoverage] BlockStatement
src/components/VirtualizedList/useSimulatedFetch.tsx:3:76
 import { useState, useEffect } from "react"
 
-export const useSimulatedFetch = (data: string[], delay: number = 1000) => {
-  const [result, setResult] = useState<string[]>([])
-  const [loading, setLoading] = useState(false) // Add a loading state
-
-  useEffect(() => {
-    setLoading(true) // Update loading state when effect runs
-    const timer = setTimeout(() => {
-      setResult(data)
-      setLoading(false) // Update loading state when data is ready
-    }, delay)
-    return () => clearTimeout(timer)
-  }, [])
-
-  if (loading) {
-    // This is the crucial part for Suspense to work
-    throw new Promise((resolve) => setTimeout(resolve, delay))
-  }
-
-  return result
-}
+export const useSimulatedFetch = (data: string[], delay: number = 1000) => {}
 

[NoCoverage] ArrayDeclaration
src/components/VirtualizedList/useSimulatedFetch.tsx:4:50
 import { useState, useEffect } from "react"
 
 export const useSimulatedFetch = (data: string[], delay: number = 1000) => {
-  const [result, setResult] = useState<string[]>([])
+  const [result, setResult] = useState<string[]>(["Stryker was here"])
   const [loading, setLoading] = useState(false) // Add a loading state
 

[NoCoverage] BooleanLiteral
src/components/VirtualizedList/useSimulatedFetch.tsx:5:42
 
 export const useSimulatedFetch = (data: string[], delay: number = 1000) => {
   const [result, setResult] = useState<string[]>([])
-  const [loading, setLoading] = useState(false) // Add a loading state
+  const [loading, setLoading] = useState(true) // Add a loading state
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/components/VirtualizedList/useSimulatedFetch.tsx:7:19
   const [result, setResult] = useState<string[]>([])
   const [loading, setLoading] = useState(false) // Add a loading state
 
-  useEffect(() => {
-    setLoading(true) // Update loading state when effect runs
-    const timer = setTimeout(() => {
-      setResult(data)
-      setLoading(false) // Update loading state when data is ready
-    }, delay)
-    return () => clearTimeout(timer)
-  }, [])
+  useEffect(() => {}, [])
 
   if (loading) {

[NoCoverage] BooleanLiteral
src/components/VirtualizedList/useSimulatedFetch.tsx:8:16
   const [loading, setLoading] = useState(false) // Add a loading state
 
   useEffect(() => {
-    setLoading(true) // Update loading state when effect runs
+    setLoading(false) // Update loading state when effect runs
     const timer = setTimeout(() => {
       setResult(data)

[NoCoverage] BlockStatement
src/components/VirtualizedList/useSimulatedFetch.tsx:9:36
 
   useEffect(() => {
     setLoading(true) // Update loading state when effect runs
-    const timer = setTimeout(() => {
-      setResult(data)
-      setLoading(false) // Update loading state when data is ready
-    }, delay)
+    const timer = setTimeout(() => {}, delay)
     return () => clearTimeout(timer)
   }, [])

[NoCoverage] BooleanLiteral
src/components/VirtualizedList/useSimulatedFetch.tsx:11:18
     setLoading(true) // Update loading state when effect runs
     const timer = setTimeout(() => {
       setResult(data)
-      setLoading(false) // Update loading state when data is ready
+      setLoading(true) // Update loading state when data is ready
     }, delay)
     return () => clearTimeout(timer)

[NoCoverage] ArrowFunction
src/components/VirtualizedList/useSimulatedFetch.tsx:13:12
       setResult(data)
       setLoading(false) // Update loading state when data is ready
     }, delay)
-    return () => clearTimeout(timer)
+    return () => undefined
   }, [])
 

[NoCoverage] BlockStatement
src/components/VirtualizedList/useSimulatedFetch.tsx:16:16
     return () => clearTimeout(timer)
   }, [])
 
-  if (loading) {
-    // This is the crucial part for Suspense to work
-    throw new Promise((resolve) => setTimeout(resolve, delay))
-  }
+  if (loading) {}
 
   return result

[NoCoverage] ArrowFunction
src/components/VirtualizedList/useSimulatedFetch.tsx:18:23
 
   if (loading) {
     // This is the crucial part for Suspense to work
-    throw new Promise((resolve) => setTimeout(resolve, delay))
+    throw new Promise(() => undefined)
   }
 
