[NoCoverage] BlockStatement
src/gql/fragment-masking.ts:41:52
 export function useFragment<TType>(
   _documentNode: DocumentTypeDecoration<TType, any>,
   fragmentType: FragmentType<DocumentTypeDecoration<TType, any>> | ReadonlyArray<FragmentType<DocumentTypeDecoration<TType, any>>> | null | undefined
-): TType | ReadonlyArray<TType> | null | undefined {
-  return fragmentType as any;
-}
+): TType | ReadonlyArray<TType> | null | undefined {}
 
 

[NoCoverage] BlockStatement
src/gql/fragment-masking.ts:49:44
 export function makeFragmentData<
   F extends DocumentTypeDecoration<any, any>,
   FT extends ResultOf<F>
->(data: FT, _fragment: F): FragmentType<F> {
-  return data as FragmentType<F>;
-}
+>(data: FT, _fragment: F): FragmentType<F> {}
 export function isFragmentReady<TQuery, TFrag>(
   queryNode: DocumentTypeDecoration<TQuery, any>,

[NoCoverage] BlockStatement
src/gql/fragment-masking.ts:56:46
   queryNode: DocumentTypeDecoration<TQuery, any>,
   fragmentNode: TypedDocumentNode<TFrag>,
   data: FragmentType<TypedDocumentNode<Incremental<TFrag>, any>> | null | undefined
-): data is FragmentType<typeof fragmentNode> {
-  const deferredFields = (queryNode as { __meta__?: { deferredFields: Record<string, (keyof TFrag)[]> } }).__meta__
-    ?.deferredFields;
-
-  if (!deferredFields) return true;
-
-  const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;
-  const fragName = fragDef?.name?.value;
-
-  const fields = (fragName && deferredFields[fragName]) || [];
-  return fields.length > 0 && fields.every(field => data && field in data);
-}
+): data is FragmentType<typeof fragmentNode> {}
 

[NoCoverage] OptionalChaining
src/gql/fragment-masking.ts:57:26
   fragmentNode: TypedDocumentNode<TFrag>,
   data: FragmentType<TypedDocumentNode<Incremental<TFrag>, any>> | null | undefined
 ): data is FragmentType<typeof fragmentNode> {
-  const deferredFields = (queryNode as { __meta__?: { deferredFields: Record<string, (keyof TFrag)[]> } }).__meta__
-    ?.deferredFields;
+  const deferredFields = (queryNode as {
+  __meta__?: {
+    deferredFields: Record<string, (keyof TFrag)[]>;
+  };
+}).__meta__.deferredFields;
 
   if (!deferredFields) return true;

[NoCoverage] BooleanLiteral
src/gql/fragment-masking.ts:60:31
   const deferredFields = (queryNode as { __meta__?: { deferredFields: Record<string, (keyof TFrag)[]> } }).__meta__
     ?.deferredFields;
 
-  if (!deferredFields) return true;
+  if (!deferredFields) return false;
 
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;

[NoCoverage] ConditionalExpression
src/gql/fragment-masking.ts:60:7
   const deferredFields = (queryNode as { __meta__?: { deferredFields: Record<string, (keyof TFrag)[]> } }).__meta__
     ?.deferredFields;
 
-  if (!deferredFields) return true;
+  if (true) return true;
 
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;

[NoCoverage] OptionalChaining
src/gql/fragment-masking.ts:63:20
   if (!deferredFields) return true;
 
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;
-  const fragName = fragDef?.name?.value;
+  const fragName = fragDef.name?.value;
 
   const fields = (fragName && deferredFields[fragName]) || [];

[NoCoverage] OptionalChaining
src/gql/fragment-masking.ts:63:20
   if (!deferredFields) return true;
 
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;
-  const fragName = fragDef?.name?.value;
+  const fragName = fragDef?.name.value;
 
   const fields = (fragName && deferredFields[fragName]) || [];

[NoCoverage] ConditionalExpression
src/gql/fragment-masking.ts:65:18
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;
   const fragName = fragDef?.name?.value;
 
-  const fields = (fragName && deferredFields[fragName]) || [];
+  const fields = true;
   return fields.length > 0 && fields.every(field => data && field in data);
 }

[NoCoverage] LogicalOperator
src/gql/fragment-masking.ts:65:19
   const fragDef = fragmentNode.definitions[0] as FragmentDefinitionNode | undefined;
   const fragName = fragDef?.name?.value;
 
-  const fields = (fragName && deferredFields[fragName]) || [];
+  const fields = (fragName || deferredFields[fragName]) || [];
   return fields.length > 0 && fields.every(field => data && field in data);
 }

[NoCoverage] ArrowFunction
src/gql/fragment-masking.ts:66:44
   const fragName = fragDef?.name?.value;
 
   const fields = (fragName && deferredFields[fragName]) || [];
-  return fields.length > 0 && fields.every(field => data && field in data);
+  return fields.length > 0 && fields.every(() => undefined);
 }
 

[NoCoverage] ConditionalExpression
src/gql/fragment-masking.ts:66:10
   const fragName = fragDef?.name?.value;
 
   const fields = (fragName && deferredFields[fragName]) || [];
-  return fields.length > 0 && fields.every(field => data && field in data);
+  return true;
 }
 
