[NoCoverage] BlockStatement
src/gql/gql.ts:73:41
  */
 export function graphql(source: "\n  subscription OnTimeUpdated {\n    timeUpdated\n  }\n"): (typeof documents)["\n  subscription OnTimeUpdated {\n    timeUpdated\n  }\n"];
 
-export function graphql(source: string) {
-  return (documents as any)[source] ?? {};
-}
+export function graphql(source: string) {}
 
 export type DocumentType<TDocumentNode extends DocumentNode<any, any>> = TDocumentNode extends DocumentNode<  infer TType,  any>  ? TType  : never;

[NoCoverage] LogicalOperator
src/gql/gql.ts:74:10
 export function graphql(source: "\n  subscription OnTimeUpdated {\n    timeUpdated\n  }\n"): (typeof documents)["\n  subscription OnTimeUpdated {\n    timeUpdated\n  }\n"];
 
 export function graphql(source: string) {
-  return (documents as any)[source] ?? {};
+  return (documents as any)[source] && {};
 }
 
