[NoCoverage] BlockStatement
src/hooks/reactQuery/useCreateBook.ts:12:49
 export const useCreateBook = () => {
   const queryClient = useQueryClient()
   return useMutation<void, Error, NewBookType>({
-    mutationFn: async (newBook: NewBookType) => {
-      const booksResponse = await fetch("http://localhost:3001/books")
-      if (!booksResponse.ok) {
-        throw new Error("Failed to fetch books")
-      }
-      const books = await booksResponse.json()
-      const nextId = books.reduce((maxId: number, book: { id: number }) => Math.max(book.id, maxId), 0) + 1
-
-      // Create the new book with the next ID
-      const response = await fetch("http://localhost:3001/books", {
-        method: "POST",
-        headers: {
-          "Content-Type": "application/json",
-        },
-        body: JSON.stringify({ ...newBook, id: nextId }),
-      })
-      if (!response.ok) {
-        throw new Error("Network response was not ok")
-      }
-    },
+    mutationFn: async (newBook: NewBookType) => {},
     onSuccess: () => {
       // Invalidate the 'books' query to refetch the books list including the new book

[NoCoverage] BlockStatement
src/hooks/reactQuery/useCreateBook.ts:14:30
   return useMutation<void, Error, NewBookType>({
     mutationFn: async (newBook: NewBookType) => {
       const booksResponse = await fetch("http://localhost:3001/books")
-      if (!booksResponse.ok) {
-        throw new Error("Failed to fetch books")
-      }
+      if (!booksResponse.ok) {}
       const books = await booksResponse.json()
       const nextId = books.reduce((maxId: number, book: { id: number }) => Math.max(book.id, maxId), 0) + 1

[NoCoverage] BooleanLiteral
src/hooks/reactQuery/useCreateBook.ts:14:11
   return useMutation<void, Error, NewBookType>({
     mutationFn: async (newBook: NewBookType) => {
       const booksResponse = await fetch("http://localhost:3001/books")
-      if (!booksResponse.ok) {
+      if (booksResponse.ok) {
         throw new Error("Failed to fetch books")
       }

[NoCoverage] ArrowFunction
src/hooks/reactQuery/useCreateBook.ts:18:35
         throw new Error("Failed to fetch books")
       }
       const books = await booksResponse.json()
-      const nextId = books.reduce((maxId: number, book: { id: number }) => Math.max(book.id, maxId), 0) + 1
+      const nextId = books.reduce(() => undefined, 0) + 1
 
       // Create the new book with the next ID

[NoCoverage] ArithmeticOperator
src/hooks/reactQuery/useCreateBook.ts:18:22
         throw new Error("Failed to fetch books")
       }
       const books = await booksResponse.json()
-      const nextId = books.reduce((maxId: number, book: { id: number }) => Math.max(book.id, maxId), 0) + 1
+      const nextId = books.reduce((maxId: number, book: {
+  id: number;
+}) => Math.max(book.id, maxId), 0) - 1
 
       // Create the new book with the next ID

[NoCoverage] StringLiteral
src/hooks/reactQuery/useCreateBook.ts:21:36
       const nextId = books.reduce((maxId: number, book: { id: number }) => Math.max(book.id, maxId), 0) + 1
 
       // Create the new book with the next ID
-      const response = await fetch("http://localhost:3001/books", {
+      const response = await fetch("", {
         method: "POST",
         headers: {

[NoCoverage] StringLiteral
src/hooks/reactQuery/useCreateBook.ts:24:27
       const response = await fetch("http://localhost:3001/books", {
         method: "POST",
         headers: {
-          "Content-Type": "application/json",
+          "Content-Type": "",
         },
         body: JSON.stringify({ ...newBook, id: nextId }),

[NoCoverage] BooleanLiteral
src/hooks/reactQuery/useCreateBook.ts:28:11
         },
         body: JSON.stringify({ ...newBook, id: nextId }),
       })
-      if (!response.ok) {
+      if (response.ok) {
         throw new Error("Network response was not ok")
       }

[NoCoverage] BlockStatement
src/hooks/reactQuery/useCreateBook.ts:28:25
         },
         body: JSON.stringify({ ...newBook, id: nextId }),
       })
-      if (!response.ok) {
-        throw new Error("Network response was not ok")
-      }
+      if (!response.ok) {}
     },
     onSuccess: () => {

[NoCoverage] BlockStatement
src/hooks/reactQuery/useCreateBook.ts:32:22
         throw new Error("Network response was not ok")
       }
     },
-    onSuccess: () => {
-      // Invalidate the 'books' query to refetch the books list including the new book
-      queryClient.invalidateQueries({ queryKey: ["books"] })
-    },
+    onSuccess: () => {},
   })
 }

[NoCoverage] ArrayDeclaration
src/hooks/reactQuery/useCreateBook.ts:34:49
     },
     onSuccess: () => {
       // Invalidate the 'books' query to refetch the books list including the new book
-      queryClient.invalidateQueries({ queryKey: ["books"] })
+      queryClient.invalidateQueries({ queryKey: [] })
     },
   })

[NoCoverage] StringLiteral
src/hooks/reactQuery/useCreateBook.ts:34:50
     },
     onSuccess: () => {
       // Invalidate the 'books' query to refetch the books list including the new book
-      queryClient.invalidateQueries({ queryKey: ["books"] })
+      queryClient.invalidateQueries({ queryKey: [""] })
     },
   })
