[Killed] BlockStatement
src/hooks/reactQuery/useDeleteBook.ts:3:36
 import { useMutation, useQueryClient } from "@tanstack/react-query"
 
-export const useDeleteBook = () => {
-  const queryClient = useQueryClient()
-  return useMutation<void, Error, number>({
-    mutationFn: async (bookId: number) => {
-      const response = await fetch(`http://localhost:3001/books/${bookId}`, {
-        method: "DELETE",
-      })
-      if (!response.ok) {
-        throw new Error("Network response was not ok")
-      }
-    },
-    onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ["books"] })
-    },
-  })
-}
+export const useDeleteBook = () => {}
 
killedBy: BookList renders books and allows interaction
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[NoCoverage] BlockStatement
src/hooks/reactQuery/useDeleteBook.ts:6:43
 export const useDeleteBook = () => {
   const queryClient = useQueryClient()
   return useMutation<void, Error, number>({
-    mutationFn: async (bookId: number) => {
-      const response = await fetch(`http://localhost:3001/books/${bookId}`, {
-        method: "DELETE",
-      })
-      if (!response.ok) {
-        throw new Error("Network response was not ok")
-      }
-    },
+    mutationFn: async (bookId: number) => {},
     onSuccess: () => {
       queryClient.invalidateQueries({ queryKey: ["books"] })

[NoCoverage] ObjectLiteral
src/hooks/reactQuery/useDeleteBook.ts:7:77
   const queryClient = useQueryClient()
   return useMutation<void, Error, number>({
     mutationFn: async (bookId: number) => {
-      const response = await fetch(`http://localhost:3001/books/${bookId}`, {
-        method: "DELETE",
-      })
+      const response = await fetch(`http://localhost:3001/books/${bookId}`, {})
       if (!response.ok) {
         throw new Error("Network response was not ok")

[NoCoverage] BlockStatement
src/hooks/reactQuery/useDeleteBook.ts:14:22
         throw new Error("Network response was not ok")
       }
     },
-    onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ["books"] })
-    },
+    onSuccess: () => {},
   })
 }

[NoCoverage] ObjectLiteral
src/hooks/reactQuery/useDeleteBook.ts:15:37
       }
     },
     onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ["books"] })
+      queryClient.invalidateQueries({})
     },
   })

[NoCoverage] StringLiteral
src/hooks/reactQuery/useDeleteBook.ts:15:50
       }
     },
     onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: ["books"] })
+      queryClient.invalidateQueries({ queryKey: [""] })
     },
   })
