[NoCoverage] BlockStatement
src/hooks/reactQuery/useGetBooks.ts:4:32
 import { useQuery } from "@tanstack/react-query"
 import { BookType } from "../../types/bookType"
 
-const fetchPosts = async () => {
-  const response = await fetch("http://localhost:3001/books")
-  if (!response.ok) {
-    throw new Error("Network response was not ok")
-  }
-  return response.json() as Promise<BookType[]>
-}
+const fetchPosts = async () => {}
 
 export const useGetBooks = () => {

[NoCoverage] BooleanLiteral
src/hooks/reactQuery/useGetBooks.ts:6:7
 
 const fetchPosts = async () => {
   const response = await fetch("http://localhost:3001/books")
-  if (!response.ok) {
+  if (response.ok) {
     throw new Error("Network response was not ok")
   }

[NoCoverage] ConditionalExpression
src/hooks/reactQuery/useGetBooks.ts:6:7
 
 const fetchPosts = async () => {
   const response = await fetch("http://localhost:3001/books")
-  if (!response.ok) {
+  if (true) {
     throw new Error("Network response was not ok")
   }

[NoCoverage] BlockStatement
src/hooks/reactQuery/useGetBooks.ts:12:34
   return response.json() as Promise<BookType[]>
 }
 
-export const useGetBooks = () => {
-  return useQuery({
-    queryKey: ["books"],
-    queryFn: fetchPosts,
-    retry: 2,
-    retryDelay: 2000,
-  })
-}
+export const useGetBooks = () => {}
 

[NoCoverage] StringLiteral
src/hooks/reactQuery/useGetBooks.ts:14:16
 
 export const useGetBooks = () => {
   return useQuery({
-    queryKey: ["books"],
+    queryKey: [""],
     queryFn: fetchPosts,
     retry: 2,
