[NoCoverage] BlockStatement
src/hooks/reactQuery/useGetSingleBook.ts:4:51
 import { useQuery } from "@tanstack/react-query"
 import { BookType } from "../../types/bookType"
 
-const fetchSingleBook = async (bookId: number) => {
-  const response = await fetch(`http://localhost:3001/books/${bookId}`)
-  if (!response.ok) {
-    throw new Error("Network response was not ok")
-  }
-  return response.json() as Promise<BookType>
-}
+const fetchSingleBook = async (bookId: number) => {}
 
 export const useGetSingleBook = (bookId: number) => {

[NoCoverage] ConditionalExpression
src/hooks/reactQuery/useGetSingleBook.ts:6:7
 
 const fetchSingleBook = async (bookId: number) => {
   const response = await fetch(`http://localhost:3001/books/${bookId}`)
-  if (!response.ok) {
+  if (false) {
     throw new Error("Network response was not ok")
   }

[NoCoverage] ConditionalExpression
src/hooks/reactQuery/useGetSingleBook.ts:6:7
 
 const fetchSingleBook = async (bookId: number) => {
   const response = await fetch(`http://localhost:3001/books/${bookId}`)
-  if (!response.ok) {
+  if (true) {
     throw new Error("Network response was not ok")
   }

[NoCoverage] BlockStatement
src/hooks/reactQuery/useGetSingleBook.ts:12:53
   return response.json() as Promise<BookType>
 }
 
-export const useGetSingleBook = (bookId: number) => {
-  return useQuery({
-    queryKey: ["book", bookId],
-    queryFn: () => fetchSingleBook(bookId),
-    retry: 2,
-    retryDelay: 2000,
-  })
-}
+export const useGetSingleBook = (bookId: number) => {}
 

[NoCoverage] ArrayDeclaration
src/hooks/reactQuery/useGetSingleBook.ts:14:15
 
 export const useGetSingleBook = (bookId: number) => {
   return useQuery({
-    queryKey: ["book", bookId],
+    queryKey: [],
     queryFn: () => fetchSingleBook(bookId),
     retry: 2,

[NoCoverage] ArrowFunction
src/hooks/reactQuery/useGetSingleBook.ts:15:14
 export const useGetSingleBook = (bookId: number) => {
   return useQuery({
     queryKey: ["book", bookId],
-    queryFn: () => fetchSingleBook(bookId),
+    queryFn: () => undefined,
     retry: 2,
     retryDelay: 2000,
