[NoCoverage] BlockStatement
src/pages/ApiCalls.tsx:3:31
 import { BookList } from "../components/BookList/BookList"
 
-export const ApiCalls = () => {
-  return <BookList />
-}
+export const ApiCalls = () => {}
 
