[NoCoverage] BlockStatement
src/pages/BookListGraphqlPage.tsx:3:42
 import { BookListGraphql } from "../components/BookListGraphql/BookListGraphql"
 
-export const BookListGraphqlPage = () => {
-  return (
-    <div>
-      <BookListGraphql />
-    </div>
-  )
-}
+export const BookListGraphqlPage = () => {}
 
