[NoCoverage] BooleanLiteral
src/pages/ConditionalRendering.tsx:6:72
 import { Link } from "react-router-dom"
 
 export const ConditionalRendering = () => {
-  const [displayAdditionalField, setDisplayAdditionalField] = useState(false)
+  const [displayAdditionalField, setDisplayAdditionalField] = useState(true)
   const [selectedUser, setSelectedUser] = useState("")
 

[NoCoverage] BlockStatement
src/pages/ConditionalRendering.tsx:9:29
   const [displayAdditionalField, setDisplayAdditionalField] = useState(false)
   const [selectedUser, setSelectedUser] = useState("")
 
-  const handleClick = () => {
-    setDisplayAdditionalField(!displayAdditionalField)
-  }
+  const handleClick = () => {}
 
   const handleChange = (event: { target: { value: SetStateAction<string> } }) => {

[NoCoverage] BooleanLiteral
src/pages/ConditionalRendering.tsx:10:31
   const [selectedUser, setSelectedUser] = useState("")
 
   const handleClick = () => {
-    setDisplayAdditionalField(!displayAdditionalField)
+    setDisplayAdditionalField(displayAdditionalField)
   }
 

[NoCoverage] BlockStatement
src/pages/ConditionalRendering.tsx:13:82
     setDisplayAdditionalField(!displayAdditionalField)
   }
 
-  const handleChange = (event: { target: { value: SetStateAction<string> } }) => {
-    setSelectedUser(event.target.value)
-  }
+  const handleChange = (event: { target: { value: SetStateAction<string> } }) => {}
 
   const handleBlur = () => {

[NoCoverage] BlockStatement
src/pages/ConditionalRendering.tsx:17:28
     setSelectedUser(event.target.value)
   }
 
-  const handleBlur = () => {
-    console.log("Input field lost focus")
-  }
+  const handleBlur = () => {}
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/pages/ConditionalRendering.tsx:21:19
     console.log("Input field lost focus")
   }
 
-  useEffect(() => {
-    console.log(`useEffect - inputValue changed- new value: ${selectedUser}`)
-  }, [selectedUser])
+  useEffect(() => {}, [selectedUser])
 
   return (

[NoCoverage] ConditionalExpression
src/pages/ConditionalRendering.tsx:35:10
       </button>
       <div className="flex gap-5">
         <div className="rounded-lg p-2">Here I am - no additional field</div>
-        {displayAdditionalField && <div className="rounded-lg p-2 mb-2 bg-red-500">Here I am - additional field</div>}
+        {false}
       </div>
 

[NoCoverage] LogicalOperator
src/pages/ConditionalRendering.tsx:35:10
       </button>
       <div className="flex gap-5">
         <div className="rounded-lg p-2">Here I am - no additional field</div>
-        {displayAdditionalField && <div className="rounded-lg p-2 mb-2 bg-red-500">Here I am - additional field</div>}
+        {displayAdditionalField || <div className="rounded-lg p-2 mb-2 bg-red-500">Here I am - additional field</div>}
       </div>
 

[NoCoverage] BooleanLiteral
src/pages/ConditionalRendering.tsx:38:8
         {displayAdditionalField && <div className="rounded-lg p-2 mb-2 bg-red-500">Here I am - additional field</div>}
       </div>
 
-      {!displayAdditionalField ? (
+      {displayAdditionalField ? (
         <div className="rounded-lg p-2">Here I am not visible</div>
       ) : (

[NoCoverage] StringLiteral
src/pages/ConditionalRendering.tsx:50:44
         </label>
         <input type="text" value={selectedUser} onChange={handleChange} onBlur={handleBlur} className="mt-4 px-2" />
       </form>
-      <Link className="text-blue-600 " to={`/user/${selectedUser}`}>
+      <Link className="text-blue-600 " to={``}>
         You will pass {selectedUser} value in params
       </Link>
