[NoCoverage] BlockStatement
src/pages/CurrentDateTestPage.tsx:3:42
 import { CurrentDate } from "../components/CurrentDate/CurrentDate"
 
-export const CurrentDateTestPage = () => {
-  return (
-    <div>
-      <CurrentDate />
-    </div>
-  )
-}
+export const CurrentDateTestPage = () => {}
 
