[NoCoverage] BlockStatement
src/pages/Forms.tsx:4:28
 import { ComplicatedForm } from "../components/ComplicatedForm"
 import { SimpleForm } from "../components/SimpleForm/SimpleForm"
 
-export const Forms = () => {
-  return (
-    <div className="flex flex-col justify-center items-center w-full h-full bg-red-200">
-      <SimpleForm />
-      <ComplicatedForm />
-    </div>
-  )
-}
+export const Forms = () => {}
 
