[NoCoverage] BlockStatement
src/pages/GraphqlSubscription.tsx:10:42
   }
 `
 
-export const GraphqlSubscription = () => {
-  const { data, loading } = useSubscription(SUBSCRIBE_TIME_UPDATE)
-  const formattedDate = data?.timeUpdated ? dayjs(data.timeUpdated).format("DD-MM-YYYY HH:mm:ss") : "Loading..."
-
-  return <div>{loading ? <p>Subscribing to time updates...</p> : <h4>Current Server Time: {formattedDate}</h4>}</div>
-}
+export const GraphqlSubscription = () => {}
 

[NoCoverage] OptionalChaining
src/pages/GraphqlSubscription.tsx:12:25
 
 export const GraphqlSubscription = () => {
   const { data, loading } = useSubscription(SUBSCRIBE_TIME_UPDATE)
-  const formattedDate = data?.timeUpdated ? dayjs(data.timeUpdated).format("DD-MM-YYYY HH:mm:ss") : "Loading..."
+  const formattedDate = data.timeUpdated ? dayjs(data.timeUpdated).format("DD-MM-YYYY HH:mm:ss") : "Loading..."
 
   return <div>{loading ? <p>Subscribing to time updates...</p> : <h4>Current Server Time: {formattedDate}</h4>}</div>
