[NoCoverage] BlockStatement
src/pages/SingleBook.tsx:4:33
 import { useParams } from "react-router-dom"
 import { BookDetails } from "../components/BookDetails"
 
-export const SingleBook = () => {
-  const { bookId } = useParams<{ bookId: string }>()
-
-  if (!bookId) {
-    return null
-  }
-  return <BookDetails bookId={parseInt(bookId)} />
-}
+export const SingleBook = () => {}
 

[NoCoverage] BlockStatement
src/pages/SingleBook.tsx:7:16
 export const SingleBook = () => {
   const { bookId } = useParams<{ bookId: string }>()
 
-  if (!bookId) {
-    return null
-  }
+  if (!bookId) {}
   return <BookDetails bookId={parseInt(bookId)} />
 }

[NoCoverage] BooleanLiteral
src/pages/SingleBook.tsx:7:7
 export const SingleBook = () => {
   const { bookId } = useParams<{ bookId: string }>()
 
-  if (!bookId) {
+  if (bookId) {
     return null
   }
