[NoCoverage] StringLiteral
src/pages/Styling3.tsx:13:17
       <div className="flex justify-center items-center gap-10 bg-red-500 h-screen" />
       <LazyLoadImage
         src={avatar}
-        srcSet={`${avatar} 1x, ${bumble} 2x`}
+        srcSet={``}
         sizes="(max-width: 768px) 20%, (max-width: 1200px) 50%, 25%"
         alt="Avatar"

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:36:17
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 1loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] StringLiteral
src/pages/Styling3.tsx:40:14
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />
       <LazyLoadImage
-        src={"https://picsum.photos/id/1/200/300"}
+        src={""}
         sizes="(max-width: 768px) 100vw, (max-width: 1200px) 50vw, 25vw"
         alt="Screenshot"

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:45:17
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 2loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:53:17
         sizes="(max-width: 768px) 100vw, (max-width: 1200px) 50vw, 25vw"
         alt="Screenshot"
         loading="lazy"
-        onLoad={() => console.log("Image 3loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:62:17
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 4loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:71:17
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 5loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] StringLiteral
src/pages/Styling3.tsx:71:35
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 5loaded")}
+        onLoad={() => console.log("")}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />

[NoCoverage] StringLiteral
src/pages/Styling3.tsx:75:14
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />
       <LazyLoadImage
-        src={"https://picsum.photos/id/5/200/300"}
+        src={""}
         sizes="(max-width: 768px) 100vw, (max-width: 1200px) 50vw, 25vw"
         alt="Screenshot"

[NoCoverage] ArrowFunction
src/pages/Styling3.tsx:80:17
         alt="Screenshot"
         loading="lazy"
         threshold={1}
-        onLoad={() => console.log("Image 6loaded")}
+        onLoad={() => undefined}
         className="transition duration-500 ease-in-out transform hover:-translate-y-1 hover:scale-110"
       />
