[NoCoverage] BlockStatement
src/pages/VirtualizedListPage.tsx:4:42
 import { Suspense, lazy } from "react"
 import { NonVirtualizedList } from "../components/VirtualizedList/NonVirtualizedList"
 
-export const VirtualizedListPage = () => {
-  const SomeComponent = lazy(() => import("../components/VirtualizedList/VirtualizedList"))
-
-  return (
-    <div className="flex flex-col gap-10">
-      <Suspense fallback={<div>Loading Virtualized List...</div>}>
-        <SomeComponent />
-      </Suspense>
-      <NonVirtualizedList />
-    </div>
-  )
-}
+export const VirtualizedListPage = () => {}
 

[NoCoverage] ArrowFunction
src/pages/VirtualizedListPage.tsx:5:30
 import { NonVirtualizedList } from "../components/VirtualizedList/NonVirtualizedList"
 
 export const VirtualizedListPage = () => {
-  const SomeComponent = lazy(() => import("../components/VirtualizedList/VirtualizedList"))
+  const SomeComponent = lazy(() => undefined)
 
   return (
