[Killed] BlockStatement
src/components/CurrentDate/CurrentDate.tsx:1:34
-export const CurrentDate = () => {
-  const today = new Date().toDateString()
-
-  return <div>{`Today's date is ${today}`}</div>
-}
+export const CurrentDate = () => {}
 
killedBy: displays the current date
statusReason: TestingLibraryElementError: Unable to find an element with the text: Today's date is Sat Apr 01 2023. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
