[Killed] BooleanLiteral
src/components/SimpleForm/SimpleForm.tsx:5:44
 import { useState } from "react"
 
 export const SimpleForm = () => {
-  const [isActive, setIsActive] = useState(true)
+  const [isActive, setIsActive] = useState(false)
   const [name, setName] = useState<string>()
 
killedBy: SimpleForm renders form with input and submit button
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BlockStatement
src/components/SimpleForm/SimpleForm.tsx:8:68
   const [isActive, setIsActive] = useState(true)
   const [name, setName] = useState<string>()
 
-  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setName(e.target.value)
-  }
+  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {}
 
   const handleSubmit = (e: React.FormEvent) => {
killedBy: SimpleForm updates input value on change
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Test Name.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BlockStatement
src/components/SimpleForm/SimpleForm.tsx:12:48
     setName(e.target.value)
   }
 
-  const handleSubmit = (e: React.FormEvent) => {
-    e.preventDefault()
-    console.log(name)
-    setIsActive(false)
-  }
+  const handleSubmit = (e: React.FormEvent) => {}
 
   const handleToggleEdit = () => {
killedBy: SimpleForm submits form and displays name
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BooleanLiteral
src/components/SimpleForm/SimpleForm.tsx:15:17
   const handleSubmit = (e: React.FormEvent) => {
     e.preventDefault()
     console.log(name)
-    setIsActive(false)
+    setIsActive(true)
   }
 
killedBy: SimpleForm submits form and displays name
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BlockStatement
src/components/SimpleForm/SimpleForm.tsx:18:34
     setIsActive(false)
   }
 
-  const handleToggleEdit = () => {
-    setIsActive((prev) => !prev)
-  }
+  const handleToggleEdit = () => {}
 
   return (
killedBy: SimpleForm toggles form edit
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] ArrowFunction
src/components/SimpleForm/SimpleForm.tsx:19:17
   }
 
   const handleToggleEdit = () => {
-    setIsActive((prev) => !prev)
+    setIsActive(() => undefined)
   }
 
killedBy: SimpleForm toggles form edit
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BooleanLiteral
src/components/SimpleForm/SimpleForm.tsx:19:27
   }
 
   const handleToggleEdit = () => {
-    setIsActive((prev) => !prev)
+    setIsActive((prev) => prev)
   }
 
killedBy: SimpleForm toggles form edit
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] ConditionalExpression
src/components/SimpleForm/SimpleForm.tsx:28:47
       {isActive ? (
         <form onSubmit={handleSubmit}>
           <label htmlFor="name">Name</label>
-          <input id="name" name="name" value={name || ""} onChange={handleChange} placeholder="Name" />
+          <input id="name" name="name" value={false} onChange={handleChange} placeholder="Name" />
           <button type="submit">Submit</button>
         </form>
killedBy: SimpleForm updates input value on change
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Test Name.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] LogicalOperator
src/components/SimpleForm/SimpleForm.tsx:28:47
       {isActive ? (
         <form onSubmit={handleSubmit}>
           <label htmlFor="name">Name</label>
-          <input id="name" name="name" value={name || ""} onChange={handleChange} placeholder="Name" />
+          <input id="name" name="name" value={name && ""} onChange={handleChange} placeholder="Name" />
           <button type="submit">Submit</button>
         </form>
killedBy: SimpleForm updates input value on change
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Test Name.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h2>
        Create and edit form

[Killed] BooleanLiteral
src/components/SimpleForm/SimpleForm.tsx:34:8
       ) : (
         <p>{name}</p>
       )}
-      {!isActive && <button onClick={handleToggleEdit}>Edit form</button>}
+      {isActive && <button onClick={handleToggleEdit}>Edit form</button>}
     </div>
   )
killedBy: SimpleForm toggles form edit
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/edit form/i`

Here are the accessible roles:

  heading:

  Name "Create and edit form":
  <h2 />

[Killed] ConditionalExpression
src/components/SimpleForm/SimpleForm.tsx:34:8
       ) : (
         <p>{name}</p>
       )}
-      {!isActive && <button onClick={handleToggleEdit}>Edit form</button>}
+      {false}
     </div>
   )
killedBy: SimpleForm toggles form edit
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/edit form/i`

Here are the accessible roles:

  heading:

  Name "Create and edit form":
  <h2 />
