[Killed] BlockStatement
src/utils/virtualizedList.ts:1:53
-export const generateLongList = (length: number) => {
-  return Array.from({ length }, (_, index) => `Item ${index + 1}`)
-}
+export const generateLongList = (length: number) => {}
 
killedBy: generateLongList should generate an empty list when length is 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrowFunction
src/utils/virtualizedList.ts:2:33
 export const generateLongList = (length: number) => {
-  return Array.from({ length }, (_, index) => `Item ${index + 1}`)
+  return Array.from({ length }, () => undefined)
 }
 
killedBy: generateLongList should generate a list with correctly formatted items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "Item 1",
-   "Item 2",

[Killed] ArithmeticOperator
src/utils/virtualizedList.ts:2:55
 export const generateLongList = (length: number) => {
-  return Array.from({ length }, (_, index) => `Item ${index + 1}`)
+  return Array.from({ length }, (_, index) => `Item ${index - 1}`)
 }
 
killedBy: generateLongList should generate a list with correctly formatted items
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   "Item -1",
+   "Item 0",
