[Killed] ArrowFunction
src/components/BookList/bookFactory.ts:4:53
 import { Factory } from "fishery"
 import { BookType } from "../../types/bookType"
 
-export const bookFactory = Factory.define<BookType>(({ sequence }) => ({
-  id: sequence,
-  title: `Book ${sequence}`,
-  author: `Author ${sequence}r`,
-}))
+export const bookFactory = Factory.define<BookType>(() => undefined)
 
killedBy: BookList renders books and allows interaction
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/components/BookList/bookFactory.ts:4:72
 import { Factory } from "fishery"
 import { BookType } from "../../types/bookType"
 
-export const bookFactory = Factory.define<BookType>(({ sequence }) => ({
-  id: sequence,
-  title: `Book ${sequence}`,
-  author: `Author ${sequence}r`,
-}))
+export const bookFactory = Factory.define<BookType>(({ sequence }) => ({}))
 
killedBy: BookList renders books and allows interaction
statusReason: TestingLibraryElementError: Unable to find an element with the text: Book 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-auto w-full mb-10"
    >
